RT-Thread/rt-thread/bsp/msp432e401y-LaunchPad/libraries/msp432e4/driverlib/timer.c
//*****************************************************************************
//
//! Returns the events that can cause an ADC trigger event.
//!
//! \param ui32Base is the base address of the timer module.
//!
//! This function returns the timer events that can cause an ADC trigger event.
//! The ADC trigger events are the logical OR of any of the following values:
//!
//! - \b TIMER_ADC_MODEMATCH_B - The mode match ADC trigger for timer B is
//!   enabled.
//! - \b TIMER_ADC_CAPEVENT_B - The capture event ADC trigger for timer B is
//!   enabled.
//! - \b TIMER_ADC_CAPMATCH_B - The capture match ADC trigger for timer B is
//!   enabled.
//! - \b TIMER_ADC_TIMEOUT_B - The timeout ADC trigger for timer B is enabled.
//! - \b TIMER_ADC_MODEMATCH_A - The mode match ADC trigger for timer A is
//!   enabled.
//! - \b TIMER_ADC_RTC_A - The RTC ADC trigger for timer A is enabled.
//! - \b TIMER_ADC_CAPEVENT_A - The capture event ADC trigger for timer A is
//!   enabled.
//! - \b TIMER_ADC_CAPMATCH_A - The capture match ADC trigger for timer A is
//!   enabled.
//! - \b TIMER_ADC_TIMEOUT_A - The timeout ADC trigger for timer A is enabled.
//!
//! \return The timer events that trigger the ADC.
//
//*****************************************************************************
uint32_t
TimerADCEventGet(uint32_t ui32Base)
{
    //
    // Check the arguments.
    //
    ASSERT(_TimerBaseValid(ui32Base));

    //
    // Return the current ADC triggers.
    //
    return (HWREG(ui32Base + TIMER_O_ADCEV));
}

//*****************************************************************************
//
//! Enables the events that can trigger a uDMA request.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32DMAEvent is a bit mask of the events that can trigger uDMA.
//!
//! This function enables the timer events that can trigger the start of a uDMA
//! sequence.  The uDMA trigger events are specified in the \e ui32DMAEvent
//! parameter by passing in the logical OR of the following values:
//!
//! - \b TIMER_DMA_MODEMATCH_B - The mode match uDMA trigger for timer B is
//!   enabled.
//! - \b TIMER_DMA_CAPEVENT_B - The capture event uDMA trigger for timer B is
//!   enabled.
//! - \b TIMER_DMA_CAPMATCH_B - The capture match uDMA trigger for timer B is
//!   enabled.
//! - \b TIMER_DMA_TIMEOUT_B - The timeout uDMA trigger for timer B is enabled.
//! - \b TIMER_DMA_MODEMATCH_A - The mode match uDMA trigger for timer A is
//!   enabled.
//! - \b TIMER_DMA_RTC_A - The RTC uDMA trigger for timer A is enabled.
//! - \b TIMER_DMA_CAPEVENT_A - The capture event uDMA trigger for timer A is
//!   enabled.
//! - \b TIMER_DMA_CAPMATCH_A - The capture match uDMA trigger for timer A is
//!   enabled.
//! - \b TIMER_DMA_TIMEOUT_A - The timeout uDMA trigger for timer A is enabled.
//!
//! \return None.
//
//*****************************************************************************
void
TimerDMAEventSet(uint32_t ui32Base, uint32_t ui32DMAEvent)
{
    //
    // Check the arguments.
    //
    ASSERT(_TimerBaseValid(ui32Base));

    //
    // Set the uDMA triggers.
    //
    HWREG(ui32Base + TIMER_O_DMAEV) = ui32DMAEvent;
}

//*****************************************************************************
//
//! Returns the events that can trigger a uDMA request.
//!
//! \param ui32Base is the base address of the timer module.
//!
//! This function returns the timer events that can trigger the start of a uDMA
//! sequence.  The uDMA trigger events are the logical OR of the following
//! values:
//!
//! - \b TIMER_DMA_MODEMATCH_B - Enables the mode match uDMA trigger for timer
//!   B.
//! - \b TIMER_DMA_CAPEVENT_B - Enables the capture event uDMA trigger for
//!   timer B.
//! - \b TIMER_DMA_CAPMATCH_B - Enables the capture match uDMA trigger for
//!   timer B.
//! - \b TIMER_DMA_TIMEOUT_B - Enables the timeout uDMA trigger for timer B.
//! - \b TIMER_DMA_MODEMATCH_A - Enables the mode match uDMA trigger for timer
//!   A.
//! - \b TIMER_DMA_RTC_A - Enables the RTC uDMA trigger for timer A.
//! - \b TIMER_DMA_CAPEVENT_A - Enables the capture event uDMA trigger for
//!   timer A.
//! - \b TIMER_DMA_CAPMATCH_A - Enables the capture match uDMA trigger for
//!   timer A.
//! - \b TIMER_DMA_TIMEOUT_A - Enables the timeout uDMA trigger for timer A.
//!
//! \return The timer events that trigger the uDMA.
//
//*****************************************************************************
uint32_t
TimerDMAEventGet(uint32_t ui32Base)
{
    //
    // Check the arguments.
    //
    ASSERT(_TimerBaseValid(ui32Base));

    //
    // Return the current uDMA triggers.
    //
    return (HWREG(ui32Base + TIMER_O_DMAEV));
}

//*****************************************************************************
//
//! This function configures the update of timer load and match settings.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s); must be one of \b TIMER_A,
//! \b TIMER_B, or \b TIMER_BOTH.
//! \param ui32Config is a combination of the updates methods for the timers
//! specified in the \e ui32Timer parameter.
//!
//! This function configures how the timer updates the timer load and match
//! values for the timers.  The \e ui32Timer values can be \b TIMER_A,
//! \b TIMER_B, or \b TIMER_BOTH to apply the settings in \e ui32Config to
//! either timer or both timers.  If the timer is not split then the \b TIMER_A
//! should be used.  The \e ui32Config values affects when the TimerLoadSet()
//! values take effect.
//!
//! - \b TIMER_UP_LOAD_IMMEDIATE is the default mode that causes the
//! TimerLoadSet() to update the timer counter immediately.
//! - \b TIMER_UP_LOAD_TIMEOUT causes the TimerLoadSet() to
//! update the timer when it counts down to zero.
//!
//! Similarly the \e ui32Config value affects when the TimerMatchSet()
//! values take effect.
//!
//! - \b TIMER_UP_MATCH_IMMEDIATE is the default mode that causes the
//! TimerMatchSet() to update the timer match value
//! immediately.
//! - \b TIMER_UP_MATCH_TIMEOUT causes the TimerMatchSet()
//! to update the timer match value when it counts down to zero.
//!
//! \note These settings have no effect if the timer is not in count down mode
//! and are mostly useful when operating in PWM mode to allow for synchronous
//! update of timer match and load values.
//!
//! \return None.
//
//*****************************************************************************
void
TimerUpdateMode(uint32_t ui32Base, uint32_t ui32Timer, uint32_t ui32Config)
{
    uint32_t ui32Value;

    if ((ui32Timer & TIMER_A) == TIMER_A)
    {
        ui32Value = HWREG(ui32Base + TIMER_O_TAMR) & ~(0x00000500);
        ui32Value |= ui32Config;
        HWREG(ui32Base + TIMER_O_TAMR) = ui32Value;
    }

    if ((ui32Timer & TIMER_B) == TIMER_B)
    {
        ui32Value = HWREG(ui32Base + TIMER_O_TBMR) & ~(0x00000500);
        ui32Value |= ui32Config;
        HWREG(ui32Base + TIMER_O_TBMR) = ui32Value;
    }
}

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
